Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་དུ་འང་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་ཕབ་སྟེ། མེ་ཏོག་དང་སྤོས་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་རྒྱན་ཐམས་ཅད་དང་ལྡན་པའི་མཆོད་པ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་མངོན་པར་ཕབ་སྟེ།
en: Rain from clouds of jewels fell over all of this buddha realm, and there also fell rain from clouds of a variety of offerings, the entire display of flowers, perfumes, incense, garlands, ointments, powders, clothing, parasols, banners, and flags.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ངོ་། །དེའི་ལུས་དེའི་གཟུགས་བརྙན་ནི་སེམས་ཅན་ཐམས་ཅད་གནས་སུ་སྣང་བ་སྟེ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་བྱེད་པ་ལ་མངོན་པར་གཞོལ་བས།
en: He then went to where the Bhagavat was, and the image of his body appeared in the residences of all beings, appearing so as to satisfy them in accordance with their wishes.

source: རི་གྲུ་འཛིན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་དྲུང་དུ་ཡང་ཕྱིན་པར་སྣང་ངོ་།
en: He also appeared to come before the bodhisattva Avalokiteśvara.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་འཁོར་གྱི་དཀྱིལ་འཁོར་འདིར་ཕྱིན་པ་མཐོང་ངམ། སྨྲས་པ་འཕགས་པ་མཐོང་ངོ་།
en: Then the bodhisattva Avalokiteśvara said to Sudhana, the head merchant’s son, “Noble one, did you see the bodhisattva Ananyagāmin coming to the gathering of this assembly?

source: །སྨྲས་པ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: “Depart, noble one. Go to the bodhisattva Ananyagāmin and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva Avalokiteśvara, circumambulated the bodhisattva Avalokiteśvara many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Avalokiteśvara.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡེ་ཤེས་ཀྱི་གཏིང་མ་རྙེད་པའི་སེམས་ཀྱིས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བལྟ་བས་ཀྱང་མ་ངོམས་བཞིན་དུ་བསྒོ་བ་དང་། མི་འགལ་བར་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་གང་ན་བ་དེར་སོང་སྟེ།
en: Ananyagāmin Sudhana, the head merchant’s son, his mind having acquired Avalokiteśvara’s verses of wisdom, had not had enough of gazing on the bodhisattva Avalokiteśvara, but so as not to disobey his instruction, Sudhana went to where the bodhisattva Ananyagāmin was.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ།
en: He bowed his head to the feet of the bodhisattva Ananyagāmin.

source: །དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཐོབ་པའོ། །སྨྲས་པ།
en: Then the bodhisattva Ananyagāmin said, “Noble one, I have attained the bodhisattva liberation called the arising of every gateway

source: འཕགས་པ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་གང་གི་ཞབས་ཀྱི་དྲུང་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཞེས་བྱ་བ་འདི་བརྙེས།
en: Sudhana asked, “Ārya, at the feet of which tathāgata did you attain the bodhisattva liberation called the arising of every gateway

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་འདི་ནས་ཇི་སྲིད་ཅིག་ན་མཆིས།
en: How far from here is that world realm?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནས་བཞུད་ནས་ནི་ཇི་སྲིད་ཅིག་ལགས།
en: How long did it take to come from that world realm?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་གནས་འདི་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུས་ཀྱང་ཤེས་པར་དཀའ་སྟེ།
en: The bodhisattva Ananyagāmin said, “Noble one, this is something that is difficult to comprehend for beings such as the śramaṇas and brahmins in this world with its devas, humans, and asuras.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་མི་ལྡོག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མི་འཕྲོགས་པའི་ཡུལ་ཏེ། དེ་ནི་རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ། སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ། དགེ་བའི་རྩ་བ་མ་བསྩགས་པ། བསམ་པ་ཡོངས་སུ་མ་དག་པ།
en: It is the power of the bodhisattvas, the irreversible diligence of the bodhisattvas, and the unsurpassable conduct of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་མ་ཐོབ་པ། ཤེས་རབ་ཀྱི་མིག་དང་མི་ལྡན་པ་རྣམས་ཀྱིས་ཐོས་བ་འམ། ཡོངས་སུ་གཟུང་བའམ། ཡིད་ཆེས་པའམ། ཁོང་དུ་ཆུད་པར་བྱ་བར་མི་ནུས་སོ། །སྨྲས་པ།
en: “Noble one, those who are not in the care of a kalyāṇamitra, who are not regarded by the buddhas, who have not accumulated the roots of merit, who do not have a pure motivation, who have not attained the faculties of a bodhisattva, and who do not have the eyes of wisdom will not be able to hear of it, grasp it, believe in it, or comprehend it.”

source: སངས་རྒྱས་ཀྱི་མཐུ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གཟུངས་ཀྱིས་དད་པ་དང་། མོས་པར་བགྱི་ན་འཕགས་པས་བདག་ལ་བཀའ་མི་སྩལ་ཏམ།
en: Sudhana said, “Tell it to me, for I am apprehended by the buddhas and in the care of kalyāṇamitras, and I have faith and aspiration!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ང་ནི་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔལ་གྱི་སྙིང་པོ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ནས་ཡང་དག་པར་འབྱུང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་འོངས་ཏེ།
en: The bodhisattva Ananyagāmin said, “Noble one, I have come from a world realm in the eastern direction that is called Śrīgarbhavatī, the buddha realm of the Tathāgata Samanta­śrī­saṃbhava.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ནས་ཡང་དག་པར་འབྱུང་བའི་ཞབས་ཀྱི་དྲུང་ནས་ངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒོ་ཀུན་ཏུ་འགྲོ་བ་འདི་ཐོབ་བོ།
en: I obtained the bodhisattva liberation called the arising of every gateway at the feet of the Tathāgata Samanta­śrī­saṃbhava.

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་དཔལ་གྱི་སྙིང་པོ་དང་ལྡན་པ་དེ་ནས་ང་སོང་ནས་ནི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་འདས་ཏེ།
en: “Noble one, as many kalpas as there are atoms in an anabhilāpyānabhilāpya of buddha realms passed while I came from the world realm Śrīgarbhavatī.

source: སེམས་བསྐྱེད་པ་རེ་རེ་ཞིང་ཡང་གོམ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བོར་རོ།
en: “With each development of an aspiration, I took as many steps as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །གོམ་པ་རེ་རེས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་ཏེ།
en: With each step, I passed as many buddha realms as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་དང་ལྡན་པར་ཤེས་ཏེ།
en: There was a tathāgata in each of those buddha realms, and I perceived all those buddha bhagavats.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ལ་འང་དེ་བཞི་གཤེགས་པའི་མཆོད་པ་བླ་ན་མེད་པ་ཡིད་ཀྱིས་རང་བཞིན་ཆོས་ཉིད་མངོན་པར་འདུ་བ་བ་མེད་པའི་རྒྱས་བཏབ་པ་དེ་བཞིན་གཤེགས་པས་གནང་བ། བྱང་ཆུབ་སེམས་དཔའི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པས་མཆོད་པ་བྱས་སོ།
en: To all those tathāgatas I made offerings that were authorized by the tathāgatas and were unsurpassable, composed of the mind, and sealed by the noncomposite nature of phenomena and gave rise to joy in bodhisattvas.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་གྱི་ཁམས་རྒྱ་མཚོ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་ཡང་ཁོང་དུ་ཆུད་དོ།
en: “I saw in those world realms an ocean of beings, and I perceived the ocean of all their minds.

source: །དེ་དག་ཐམས་ཅད་ཀྱི་དབང་པོའི་འཁོར་ལོ་ཡང་ཡོངས་སུ་ཤེས་ཤིང་བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་བསྟན་ཏོ། །ཆོས་ཀྱི་དབྱངས་རབ་ཏུ་བསྒྲགས་སོ། །འོད་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་བཀྱེའོ། །ཡོ་བྱད་སྣ་ཚོགས་ཕུན་སུམ་ཚོགས་པས་ཀྱང་ཉེ་བར་བསྡུད་དོ། རང་གི་ལུས་ཀྱང་དེ་དག་ལ་བྱིན་གྱིས་བརླབས་ཏེ།
en: I knew the wheels of all their faculties, and I manifested physical bodies in accord with their aspirations, proclaimed the words of the Dharma, radiated a halo of light, brought them the gift of various necessities, and empowered my own body, so that I could continuously be engaged in ripening and guiding them.

source: དེ་ནི་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་སྦྱོར་བ་རྒྱུན་མི་འཆད་པའི་ཕྱིར་རོ། །ཤར་ཕྱོགས་ནས་ཇི་ལྟར་འོངས་པ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ནས་ཀྱང་དེ་བཞིན་ཏེ།
en: “In the same way that I came from the east, I came from the south, from the west, from the north, from the northeast, from the southeast, from the southwest, from the northwest, from below, and from above.

source: རིགས་ཀྱི་བུ་ངས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་ཞེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only the bodhisattva liberation called the arising of every gateway

source: ངས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་ཀུན་ཏུ་མངོན་པར་གཞོལ་བ།
en: How could I know the conduct or describe the qualities of bodhisattvas who face in all directions;

source: ཐ་མི་དད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ།
en: who have a scope of wisdom that is without division;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ལུས་རྣམ་པར་བཀོད་པ།
en: who distribute their bodies throughout the realm of phenomena;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐུན་པར་སྤྱོད་པ།
en: who act in accord with the thoughts and aspirations of all beings;

source: ཞིང་ཐམས་ཅད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ།
en: who pervade all realms with their bodies;

source: ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུད་ཀྱི་རྗེས་སུ་སོང་བ།
en: who act in conformance with all phenomena;

source: དུས་གསུམ་གྱི་རྒྱུད་མཉམ་པ་ཉིད་དུ་གྱུར་པ།
en: who have arrived at the equality of the three times;

source: ཆོས་ཕྱོགས་ཀྱི་རྒྱུད་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that are equal to the range of phenomena in every direction;

source: འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དུ་རྣམ་པར་སྣང་བ།
en: who illuminate every range of worlds of beings;

source: དེ་བཞིན་གཤེགས་པའི་རྒྱུད་ཐམས་ཅད་ལ་རྣམ་པར་རྟོག་པ་མེད་པ།
en: who have no conceptualization of the range of tathāgatas;

source: ཆགས་པ་མེད་པའི་རྒྱུད་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ།
en: who enter all regions without impediment;

source: གནས་མེད་པའི་རྒྱུད་ལ་རབ་ཏུ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: and who dwell in the state that has no location?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སྒོ་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, there is a city named Dvāravatī.

source: དེ་ན་ལྷ་ལྷ་ཆེན་པོ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: There dwells the deity by the name of Mahādeva.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bodhisattva Ananyagāmin, circumambulated the bodhisattva Ananyagāmin many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the bodhisattva Ananyagāmin.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་ཆེན་པོའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ།
en: Mahādeva Sudhana had a mind that followed the vast conduct of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་འདོད་པའི་ངང་ཚུལ་ཅན་མངོན་པར་ཤེས་པ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པའི་ཡུལ་ལ་ཡོན་ཏན་གྱི་ཁྱད་པར་དུ་ལྟ་བ།
en: He had the nature of longing for the scope of the wisdom of the bodhisattva Ananyagāmin. He saw the special qualities of accomplishing great higher cognition.

source: བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆ་རབ་ཏུ་དགའ་བའི་ཁྱད་པར་ཐོབ་པ།
en: He had attained joy in the armor of stable diligence.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བའི་རྗེས་སུ་སོང་བའི་བསམ་པ་དང་ལྡན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ས་ལ་ནི་ནན་ཏན་དུ་བྱེད།
en: He had the aspiration to follow the displays of inconceivable liberations. He practiced the qualities of the bodhisattva level.

source: ཏིང་ངེ་འཛིན་གྱི་ས་ལ་ནི་རྣམ་པར་དཔྱོད།
en: He analyzed on the level of samādhi.

source: གཟུངས་ཀྱིས་ལ་ནི་རབ་ཏུ་གནས་པར་བྱེད།
en: He was established on the level of the power of retention.

source: སྨོན་ལམ་གྱི་ས་ལ་ནི་འཇུག་པར་བྱེད།
en: He engaged in the level of prayer.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ས་ལ་ནི་རྗེས་སུ་སློབ།
en: He trained in the level of discernment.

source: སྟོབས་ཀྱིས་ལ་ནི་ཡོངས་སུ་བསྒྲུབ་ཅིང་མཐར་གྱིས་གྲོང་ཁྱེར་སྒོ་དང་ལྡན་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: He was accomplishing the level of power. He eventually arrived at the city named Dvāravatī.

source: ལྷ་ལྷ་ཆེན་པོ་ཀུན་དུ་དྲིས་པ་དང་། དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་འདེ་རེ། ལྷ་ལྷ་ཆེན་པོ་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་བཞི་མདོ་ན་བདག་ཉིད་ཤིན་ཏུ་ཆེ་བས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་འདུག་གོ །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྷ་ལྷ་ཆེན་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: He inquired about the deity Mahādeva, and many people declared to him, “Noble one, this deva Mahādeva is in the temple at the crossroads of the city, and with greatness of being he is teaching the Dharma to beings.”

source: ལྷ་ལྷ་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Then Sudhana went to where the deity Mahādeva was.

source: མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: He bowed his head to the feet of Mahādeva, stood before him with his hands together in homage, and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: How does a bodhisattva train in bodhisattva conduct? In what way does a bodhisattva practice it?

source: །དེ་ནས་ལྷ་ལྷ་ཆེན་པོས་ལག་པ་བཞི་ཕྱོགས་བཞིར་བརྐྱང་སྟེ། རྒྱ་མཚོ་ཆེན་པོ་བཞི་ལས་ཤིན་ཏུ་མྱུར་བའི་ཤུགས་ཀྱིས་ཆུ་བླངས་ཏེ།
en: The deity Mahādeva extended his four arms, and from the four great oceans and with the power of great speed he brought water and washed his mouth.

source: བདག་གིས་གདོང་བཀྲུས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གསེར་གྱི་མེ་ཏོག་གིས་གཏོར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་མཐོང་བར་ཤིན་ཏུ་དཀའ་སྟེ།
en: He then scattered golden flowers on Sudhana, the head merchant’s son, and said, “Noble one, it is very difficult to see the bodhisattvas.

source: ཐོས་པར་ཡང་རབ་ཏུ་དཀའོ།
en: It is difficult to hear them.

source: །སྐྱེས་བུ་མཆོག་གི་མེ་ཏོག་པུན་ད་རི་ཀ་ནི་འཇིག་རྟེན་གྱི་ཕུལ་དུ་བྱ་བ་ཡིན་པས། ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཡིན་ཏེ།
en: The appearance of the white lotuses that are supreme beings is a great marvel because of its greatness;

source: འཇིག་རྟེན་གྱི་གནས་སུ་གྱུར་པའོ། །འགྲོ་བའི་རྟེན་དུ་གྱུར་པའོ།
en: they are a support for the world, a refuge for beings;

source: །སེམས་ཅན་རྣམས་ལ་སྣང་བ་ཆེན་པོ་འབྱིན་པའོ།
en: they create a great light for beings;

source: །ལམ་རྨོངས་པ་རྣམས་ལ་ལམ་བདེ་བ་སྟོན་པའོ།
en: they teach the path of truth to those on the path of ignorance;

source: །ཆོས་ཀྱི་ཚུལ་དུ་གཟུང་བ་ལ་མགོན་དུ་གྱུར་པའོ།
en: they are guides for those who follow the way of the Dharma;

source: །ཐམས་ཅད་མཁྱེན་པའི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱ་བ་ལ་དེད་དཔོན་ཆེན་པོར་གྱུར་པ་སྟེ།
en: they are great guides for going to the city of omniscience.

source: དེ་ལ་ཁོ་བོ་འདི་སྙམ་དུ་སེམས་སོ།
en: “Noble one, this is what I think:

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མིང་ནི་སེམས་དྲི་མ་མེད་པ་རྣམས་ལ་རང་གི་ལུས་ཀྱི་གཟུགས་བརྙན་སྟོན་ཅིང་ལུས་རྣམ་པར་དག་པ་རྣམས་ལ་མངོན་པར་སྣང་བ་དང་། ངག་གི་ཉེས་པ་སྤངས་པ་རྣམས་དབྱངས་ཀྱི་སྣང་བ་ཡོངས་སུ་གདོན་པར་བྱེད་པ་དང་། བསམ་པ་དག་པ་རྣམས་ལ་དུས་ཐམས་ཅད་དུ་མངོན་སུམ་དུ་གྱུར་པར་གནས་པས།
en: the bodhisattva mahāsattvas are called the destroyers of wrong views because, with stainless minds, they manifest the appearance of their pure bodies; they manifest the activities of their pure bodies; they shine the light of eloquence of their faultless speech; and with a pure motivation they remain manifest at all times.

source: ལྟ་བ་ངན་པ་འཇོམས་པ་ཡིན་པར་བསམས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྤྲིན་གྱི་དྲ་བ་ཐོབ་པའོ།
en: “Noble one, I have attained the bodhisattva liberation called the net of clouds

source: །སྨྲས་པ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྤྲིན་གྱི་དྲ་བ་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked him, “What is the scope of the bodhisattva liberation called the net of clouds

source: དེ་ནས་ལྷ་ལྷ་ཆེན་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མདུན་དུ་རི་ཆེན་པོ་ཙམ་གྱི་གསེར་གྱི་ཕུང་པོ་དང་། དངུལ་གྱི་ཕུང་པོ་དང་། བཻ་ཌཱུརྱའི་ཕུང་པོ་དང་། ཤེལ་གྱི་ཕུང་པོ་དང་། མུ་ས་ར་གལ་པའི་ཕུང་པོ་དང་། ཨ་སྨ་གར་བྷའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ངང་གིས་སྣང་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དྲི་མ་མེད་པའི་སྙིང་པོའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་ཀུན་ཏུ་མངོན་པའི་ཕུང་པོ་དང་། གཙུག་གི་ནོར་བུ་རིན་པོ་ཆེ་དང་། ཅོད་པན་གྱི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིསེ་མོ་དོའི་ཕུང་པོ་དང་། དཔུང་རྒྱན་གྱི་ཕུང་པོ་དང་། རྣ་ཆའི་རྒྱན་གྱི་ཕུང་པོ་དང་། གདུབ་བུའི་ཕུང་པོ་དང་། སྐ་རགས་ཀྱི་ཕུང་པོ་དང་། རྐང་གདུབ་ཀྱི་ཕུང་པོ་དང་། མུ་ཏིག་དམར་པོའི་དྲ་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཕུང་པོ་དང་། མེ་ཏོག་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། བདུག་པ་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་། གོས་ཐམས་ཅད་དང་། གདུགས་ཐམས་ཅད་དང་། རྒྱལ་མཚན་ཐམས་ཅད་དང་། ལྷའི་བ་དན་ཐམས་ཅད་དང་། རོལ་མོ་བརྡུང་བ་ཐམས་ཅད་དང་། རོལ་མོ་དཀྲོལ་བ་ཐམས་ཅད་དང་། འདོད་པའི་ཡུལ་ཐམས་ཅད་དང་། བུ་མོ་བྱེ་བ་བརྒྱ་སྟོང་གྲངས་མེད་པ་དག་ཀྱང་ཉེ་བར་བསྟན་ནས།
en: In every direction in front of Sudhana, the head merchant’s son, the deva Mahādeva manifested mountain-sized heaps of gold, heaps of silver, heaps of beryls, heaps of crystals, heaps of white corals, heaps of emeralds, heaps of precious asteria jewels, heaps of precious vimalagarbha jewels, heaps of precious vairocana jewels, heaps of precious topknot jewels, heaps of crowns, heaps of necklaces made of various precious jewels, heaps of armlets, heaps of earrings, heaps of bracelets, heaps of girdles, heaps of anklets, heaps of strings of red pearls, heaps of various precious jewels, heaps of adornment for the greater and smaller parts of the body, heaps of the kings of wish-fulfilling precious jewels, all flowers, all perfumes, all incenses, all garlands, all ointments, all powders, all cloths, all parasols, all banners, all flags, all musical instruments, all percussion instruments, all that is desirable, and countless trillions of maidens.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་དག་ལས་ཁྱེར་ལ།
en: Mahādeva said to Sudhana, the head merchant’s son, “Noble one, take these, and with them perform acts of great generosity!

source: སྦྱིན་པ་མང་པོ་ནི་བྱིན་ཅིག །བསོད་ནམས་མང་པོ་ནི་གྱིས་ཤིག །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་ཅིག །སེམས་ཅན་མང་པོ་ནི་སྦྱིན་པས་བསྡུ་བའི་དངོས་པོས་ཡོངས་སུ་བསྡུས་ཏེ།
en: Create much merit! Make offerings to the tathāgatas! Gather many beings through generosity as a method of gathering pupils!

source: གཏོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཁོད་ཅིག །འཇིག་རྟེན་ནི་སྦྱིན་པ་ལ་སློབས་ཤིག །གཏང་བར་དགའ་བ་ཡོངས་སུ་གཏང་བ་ནི་སྟོན་ཅིག །རིགས་ཀྱི་བུ་ཁྱོད་ལ་ཁོ་བོས་ཇི་ལྟར་ཡོ་བྱད་ཀྱི་རྣམ་པས་བསྡུད་པ་འདི་བཞིན་དུ་སྦྱིན་པའི་བསམ་པ་དང་། མ་བྲལ་བའི་སེམས་ཅན་ཚད་མེད་པ་དག་གི་བསམ་པའི་རྒྱུད་ཀྱང་གཏོང་བས་ཡོངས་སུ་བསྒོ་བ་བྱེད་དོ།
en: Practice the perfection of generosity! Teach the world through generosity! Give that which is difficult to give! “Noble one, I gather for you this manner of things, and in that same way I establish in generosity an incalculable number of beings whose minds have an unceasing motivation to give.

source: །སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལའང་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱེད་དོ།
en: I cause them to generate roots of merit in the Buddha, Dharma, and Saṅgha and the bodhisattvas and kalyāṇamitras, and I inspire them toward the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་བོ་ནི་སེམས་ཅན་འདོད་པའི་དགའ་བས་མྱོས་པ།
en: “Moreover, noble one, I bless with the ugliness of sensory objects those beings who are intoxicated by the joys of desire and have attachment to the enjoyment of sensory objects.

source: ཡུལ་གྱི་ལོངས་སྤྱོད་ལ་ཡོངས་སུ་ཆགས་པ་རྣམས་ལ་ཡུལ་དེ་དག་མི་སྡུག་པར་བྱིན་གྱིས་རློབ་བོ།།ཁྲོ་བས་ནོན་པ་དང་ང་རྒྱལ་ཅན་དང་། རྒྱགས་ཤིང་དྲེགས་པ་དང་། རློམ་པ་ཚར་གཅོད་པས། གདུལ་བ་རྣམས་ལ་ནི་གཏུམ་ཞིང་སྲིན་པོ་ལྟར་མི་སྡུག་ལ་འཇིགས་པའི་ལུས་ཤ་ཟ་ཞིང་ཁྲག་འཐུང་བའི་ཚུལ་དང་ལྡན་པར་བསྟན་ཏེ། རློམ་པ་དང་། སྙེམས་པས་འཁྲུག་པ་དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད་དོ།
en: “I manifest terrifying wrathful bodies like rākṣasas, eating flesh and drinking blood, to those who are possessed by anger, who are proud, arrogant, conceited, and haughty, and who are to be guided through destruction, pacifying all who are agitated by pride and arrogance.

source: །ལེ་ལོ་ཅན་བརྩོན་འགྲུས་བོར་བའི་སེམས་ཅན་རྣམས་ལ་ནི་མེ་དང་། ཆུ་དང་། རྒྱལ་པོ་དང་རྐུན་པོ་དང་། གནོད་པའི་འཇིགས་པ་ཡོངས་སུ་བསྟན་ཅིང་སྐྱོ་བར་བྱས་ཏེ། བརྩོན་འགྲུས་རྩོམ་པ་ལ་འགོད་པར་བྱེད་དོ།
en: “I manifest the danger of being harmed by fire, water, kings, and thieves for beings who are lazy and abandon diligence, causing them to be distressed and become diligent.

source: །དེ་ལྟར་ཐབས་དེ་དང་དེ་དག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕྱོགས་དང་མི་མཐུན་པར་རབ་ཏུ་གཞོམ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚོགས་བསྩགས་པ་དང་། སྒྲིབ་པའི་རིའི་གཡང་སའི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་། སྒྲིབ་པ་མེད་པའི་ཆོས་ལ་གཟུད་པའི་ཕྱིར་མི་དགེ་བ་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་སྟེ། དགེ་བ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དག་པར་འགོད་པ་བྱེད་དོ།
en: “In that way, through those methods, I turn them away from that which is not virtuous and establish them in a perfection of virtue so that they may defeat all that is adverse to the perfections, gather all the accumulations of the perfections, transcend all the paths of the mountain precipices of obscurations, and enter the unobscured Dharma.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྤྲིན་གྱི་དྲ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ལྟར་ཉོན་མོངས་པའི་ལྷ་མ་ཡིན་རབ་ཏུ་འཇོམས་པ།
en: “Noble one, I know only the bodhisattva liberation called the net of clouds

source: ཆུ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་མེའི་ཕུང་པོ་ཞི་བར་བྱེད་པ། མེའི་ཕུང་པོ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྲེད་པའི་ཆུ་སྐེམས་པ། རླུང་ལྟར་འཛིན་པའི་མངོན་པར་ཆགས་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་འཐོར་བ། རྡོ་རྗེ་ལྟར་བདག་གི་འདུ་ཤེས་སྲ་བའི་བྲག་རབ་ཏུ་རྙིལ་བ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who are like Indra defeating the asuras of the kleśas, who are like water extinguishing the mass of fire of the suffering of all beings, who are like a mass of flames drying up the water of the cravings of all beings, who are like a wind scattering the mountain of all clinging to attachment, and who are like thunderbolts shattering the hard rock of the perception of a self? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ཀྱི་ཡུལ་མ་ག་དྷའི་སྙིང་པོ་བྱང་ཆུབ་ན་སའི་ལྷ་མོ་བརྟན་མ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In this Jambudvīpa, in the land of Magadha, at the bodhimaṇḍa, there is the goddess of the earth who is named Sthāvarā.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་ལྷ་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’
